
sum = 0

# while sum !=100: # ป้อนตัวเลขกี่ตัวแกได้ จนกว่าค่า sum เท่ากับ 100
#     number = int(input("ป้อนตัวเลขของคุณ : "))
#     sum = sum+number # บวกเลขที่ป้อนแต่ละรอบ
#     print("ผลรวม :",sum)

# while sum <100: # ป้อนตัวเลขกี่ตัวแกได้ จนกว่าค่า sum เท่ากับ 100
#     number = int(input("ป้อนตัวเลขของคุณ : "))
#     sum = sum+number # บวกเลขที่ป้อนแต่ละรอบ
#     print("ผลรวม :",sum)


while True: # ป้อนตัวเลขกี่ตัวแกได้ จนกว่าค่า sum เท่ากับ 100
    number = int(input("ป้อนตัวเลขของคุณ : "))
    sum = sum+number # บวกเลขที่ป้อนแต่ละรอบ
    if sum>100: # ถ้า sum มากกว่า 100 ให้ออกจากลูปเลย
        break
    print("ผลรวม :",sum)

